collector/test_snmpma.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
<nmwg:message type="SetupDataRequest" id="message.13248522"  xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/">
 <nmwg:metadata xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/" id="metadata.5674757">
    <nmwg:subject id="s-in-16">
        <nmwgt:interface xmlns:nmwgt="http://ggf.org/ns/nmwg/topology/2.0/">
            <nmwgt:direction>out</nmwgt:direction>
            <nmwgt:ifAddress type="ipv4">134.55.209.42</nmwgt:ifAddress>
            <nmwgt:direction>out</nmwgt:direction>
        </nmwgt:interface>
    </nmwg:subject>
    <nmwg:eventType>http://ggf.org/ns/nmwg/tools/snmp/2.0</nmwg:eventType>
 </nmwg:metadata>
 <nmwg:metadata id="metadata.5674757.chain" xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/">
   <select:subject id="subject.4472944" metadataIdRef="metadata.5674757" xmlns:select="http://ggf.org/ns/nmwg/ops/select/2.0/"/>
        <select:parameters id="parameters.8042919" xmlns:select="http://ggf.org/ns/nmwg/ops/select/2.0/">
            <nmwg:parameter name="startTime">1299691650</nmwg:parameter>
            <nmwg:parameter name="endTime">1299691710</nmwg:parameter>
            <nmwg:parameter name="resolution">300</nmwg:parameter>
            <nmwg:parameter name="consolidationFunction">AVERAGE</nmwg:parameter>
        </select:parameters>
        <nmwg:eventType>http://ggf.org/ns/nmwg/ops/select/2.0</nmwg:eventType> 
 </nmwg:metadata>
 
 <nmwg:data id="data.6522132" metadataIdRef="metadata.5674757.chain"/>
</nmwg:message>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
